juegos/app/Controllers/RestJuegos.php

    public function show($id = null){

        if($id == null){
            return $this->genericResponse(null, "Categoria no encontrada", 500);
        }

        $juego = $this->model->where('JUEGO', $id)->findAll();
---
SELECT *
FROM `juego`
WHERE `JUEGO` = '0'